In [1]:
import psycopg2
import pandas as pd
import sqlalchemy

In [2]:
#"postgres+psycopg2://<USERNAME>:<PASSWORD>@<IP_ADDRESS>:<PORT>/<DATABASE_NAME>"
# conn = psycopg2.connect(database="blood_bank_project", user = "postgres", password = "alohomora", host = "127.0.0.1", port = "5432")
blood_bank_db_engine = sqlalchemy.create_engine("postgresql://postgres:alohomora@localhost:5432/blood_bank_project")

In [3]:
hospital_details = pd.read_csv("hospital_details.csv")
ngo_details = pd.read_csv("ngo_details.csv")
donor_details = pd.read_csv("donor.csv")
inventory_details = pd.read_csv("inventory.csv")
blood_bank_details = pd.read_csv("blood_bank.csv")
recipient_details = pd.read_csv("recipient.csv")
request_details = pd.read_csv("request.csv")

CREATE TABLE Donor(donor_id VARCHAR(15) PRIMARY KEY,
			d_name VARCHAR(50),
			age INTEGER,
			Blood_group VARCHAR(5),
			Address VARCHAR(50),
			contact_number VARCHAR(10));

CREATE TABLE Hospital(hospital_id VARCHAR(15) PRIMARY KEY,
		                h_name VARCHAR(50),
		                Address VARCHAR(50));

CREATE TABLE NGO(ngo_id VARCHAR(15) PRIMARY KEY,
		           n_name VARCHAR(50),
		           address VARCHAR(50));

CREATE TABLE BloodBank(bloodBankID VARCHAR(15) PRIMARY KEY,
			       b_name VARCHAR(50),
      			       Address VARCHAR(50),
			       contact_number VARCHAR(10));

CREATE TABLE Inventory(bloodBankID VARCHAR(15),
			    blood_group VARCHAR(5),
			    units_available INTEGER,
			    PRIMARY KEY(bloodBankID, blood_group));

CREATE TABLE Recipient(recipient_id VARCHAR(15) PRIMARY KEY,
			     	   r_name VARCHAR(50),
			     	   age INTEGER,
			     	   Blood_group VARCHAR(5),
			     	   location_received_ngo VARCHAR(15),
					   location_received_hospital VARCHAR(15),
			     	   contact_number VARCHAR(10),
			     	   CONSTRAINT fk_loc_hosp FOREIGN KEY (location_received_hospital) REFERENCES Hospital(hospital_id) ON DELETE CASCADE,
			     	   CONSTRAINT fk_loc_ngo FOREIGN KEY (location_received_ngo) REFERENCES NGO(ngo_id) ON DELETE CASCADE);

CREATE TABLE Request(request_id VARCHAR(15) PRIMARY KEY,
			   patient_id VARCHAR(15),
			   donor_id VARCHAR(15),
			   location_required VARCHAR(15),
			   blood_group VARCHAR(5),
			   waitlist INTEGER,
			   completed BOOLEAN,
			   CONSTRAINT fk_pat FOREIGN KEY (patient_id) REFERENCES Recipient(recipient_id) ON DELETE CASCADE,
			   CONSTRAINT fk_don FOREIGN KEY (donor_id) REFERENCES Donor(donor_id) ON DELETE CASCADE);

In [4]:
hospital_details.drop(["index"], axis = 1, inplace = True)

In [5]:
hospital_details.iloc[0]["Street Address"]+ " " + hospital_details.iloc[0]["city"] + " " + hospital_details.iloc[0]["state"] + " " + str(hospital_details.iloc[0]["zipcode"])

'200 Stahlhut Drive Fort Stanton NM 88323'

In [6]:
#hospital_id,h_name,Address
addresses = []
for idx in range(hospital_details.shape[0]):
    address = hospital_details.iloc[idx]["Street Address"]+ " " + hospital_details.iloc[idx]["city"]+ " " + hospital_details.iloc[idx]["state"]+ " " + str(hospital_details.iloc[idx]["zipcode"])
    # hospital_details.iloc[idx]["Address"] = address
    addresses.append(address)

In [7]:
hospital_details["Address"] = addresses
hospital_details.drop(["Street Address","city","state","zipcode"], axis = 1, inplace = True)
hospital_details["hospital_id"] = ["hosp" + f'{i:04}'for i in range(1, hospital_details.shape[0]+1)]
hospital_details.columns = ["h_name","address", "hospital_id"]
hospital_details = hospital_details[["hospital_id","h_name","address"]]

In [8]:
hospital_details.to_sql("hospital", blood_bank_db_engine, method='multi', if_exists='append', index=False)

211

In [9]:
pd.read_sql_query("SELECT * FROM hospital", blood_bank_db_engine)

,hospital_id,h_name,address
0,hosp0001,Abraham Lincoln Hospital,200 Stahlhut Drive Fort Stanton NM 88323
1,hosp0002,Adventist Bolingbrook Hospital,500 Remington Blvd Easton WA 98925
2,hosp0003,Adventist GlenOaks Hospital,701 Winthrop Avenue Elgin TX 78621
3,hosp0004,Adventist Hinsdale Hospital,120 North Oak Street Karval CO 80823
4,hosp0005,Adventist La Grange Memorial Hospital,5101 S. Willow Springs Road Cape Canaveral FL ...
...,...,...,...
206,hosp0207,Vista Medical Center East,1324 North Sheridan Road Urbana IL 61802
207,hosp0208,Vista Medical Center West,2615 West Washington Cornelius NC 28031
208,hosp0209,Wabash General Hospital District,1418 College Drive Elkton MN 55933
209,hosp0210,Warner Hospital & Health Services,422 West White Street Hopedale OH 43976
210,hosp0211,Washington County Hospital,705 South Grand Avenue Saint Paul Island AK 99660

In [10]:
# (donor_id,d_name,age,blood_group,address,contact_number)
donor_details.columns = ["donor_id","d_name","age","blood_group","address","contact_number"]
donor_details.to_sql("donor", blood_bank_db_engine, method='multi', if_exists='append', index=False)

3000

In [11]:
pd.read_sql_query("SELECT * FROM donor", blood_bank_db_engine)

,donor_id,d_name,age,blood_group,address,contact_number
0,d0178,John Mathews,37,A-,"USNV Davidson, FPO AE 05103",9661159239
1,d1221,Justin Moore,57,B+,"USCGC Nguyen, FPO AA 74562",8738337074
2,d0000,Meghan Wood,22,O-,"2018 Christopher Street, East Nancy, UT 99935",7564817810
3,d0001,Gregory Miller,24,O-,"64666 Julie Rue, New Pamelaberg, CT 21401",9891351903
4,d0002,Andrew Ochoa,53,AB+,"87506 Bray Plaza Suite 852, Lindsayshire, GA 2...",5084130484
...,...,...,...,...,...,...
2995,d2995,Omar Hodge,28,AB+,"017 Rivera Isle Apt. 004, West Patrickview, MD...",9887339080
2996,d2996,Mary Martin,28,B+,"838 Rebecca Street Apt. 866, Port Dylanshire, ...",7594578823
2997,d2997,Thomas Stanley,58,A+,"53261 Kathryn Glen, Lake Timothy, IL 57478",1830740556
2998,d2998,Carolyn Anthony,63,O-,"Unit 9377 Box 0852, DPO AA 19448",3318320262
2999,d2999,Jason Bentley,57,A+,"50766 Chapman Drive Suite 665, South Lisa, NE ...",2014500797

In [12]:
addresses = []
for idx in range(ngo_details.shape[0]):
    address = ngo_details.iloc[idx]["street"]+ " " + ngo_details.iloc[idx]["city"]+ " " + ngo_details.iloc[idx]["state"]+ " " + str(ngo_details.iloc[idx]["zipcode"])
    addresses.append(address)

In [13]:
ngo_details["address"] = addresses
ngo_details.drop(["street","city","state","zipcode"], axis = 1, inplace = True)
ngo_details["ngo_id"] = ["ngo" + f'{i:04}' for i in range(1, ngo_details.shape[0]+1)]
ngo_details.columns = ["n_name","address", "ngo_id"]
ngo_details = ngo_details[["ngo_id","n_name","address"]]

In [14]:
ngo_details.to_sql("ngo", blood_bank_db_engine, method='multi', if_exists='append', index=False)

135

In [15]:
pd.read_sql_query("SELECT * FROM ngo", blood_bank_db_engine)

,ngo_id,n_name,address
0,ngo0001,A Glimmer of Hope Foundation,9086 Kahlden Street Mountain View HI 96771
1,ngo0002,American Association for the Advancement of Sc...,1724 Pine Tree Circle Helen MD 20635
2,ngo0003,Academy for Educational Development (AED) #,9294 Poplar Woods Street Morven NC 28119
3,ngo0004,ACDI/VOCA,9163 Oren Avenue Crystal Spring PA 15536
4,ngo0005,Adventist Development and Relief Agency (ADRA),64 Talmage Drive Barwick GA 31720
...,...,...,...
130,ngo0131,World Relief Corporation of National Associati...,1579 Westminster Trail South Royalton VT 5068
131,ngo0132,World Renew (formerly Christian Reformed World...,8306 Hunters Avenue Oak Ridge NJ 7438
132,ngo0133,World Vision,2027 Creekside Trail Chatham VA 24531
133,ngo0134,World Wildlife Fund (WWF),3031 Thornvine Cove Logan UT 84322
134,ngo0135,YMCA,3356 Lennox Circle East Spencer NC 28039

In [16]:
blood_bank_details.columns = ["bloodbankid", "b_name", "address", "contact_number"]

In [17]:
blood_bank_details.to_sql("bloodbank", blood_bank_db_engine, method='multi', if_exists='append', index=False)

1000

In [18]:
pd.read_sql_query("SELECT * FROM bloodbank", blood_bank_db_engine)

,bloodbankid,b_name,address,contact_number
0,b0082,Nashville Blood Center 000,"819 Beazer Lane, Nashville, TN, 37013",8063457366
1,b0720,Pueblo West Blood Center 001,"11 North Vineyard Drive, Pueblo West, CO, 81007",5463833980
2,b0297,Middlebury Blood Center 002,"161 Creek Road, Middlebury, VT, 05753",3055447064
3,b0426,Washington Blood Center 003,"1608 Gales Street Northeast, Washington, DC, 2...",5754616323
4,b0577,Arvada Blood Center 004,"8398 West 62nd Place, Arvada, CO, 80004",4118826484
...,...,...,...,...
995,b0016,Escondido Blood Center 995,"2335 Orchard View Lane, Escondido, CA, 92027",6076868936
996,b0702,Woodland Blood Center 996,"18687 County Road 97, Woodland, CA, 95695",3680471054
997,b0931,Panama City Blood Center 997,"269 Hugh Thomas Drive, Panama City, FL, 32404",4537152678
998,b0837,Glendale Blood Center 998,"5803 West Gelding Drive, Glendale, AZ, 85306",9326833260
999,b0858,Louisville Blood Center 999,"9403 Fairground Road, Louisville, KY, 40291",4817776368

In [19]:
#(bloodBankID, blood_group , units_available)
inventory_details.columns = ["bloodbankid", "blood_group", "units_available"]
inventory_details.head()

  bloodbankid blood_group  units_available
0       b0000          A+               35
1       b0000          A-               65
2       b0000          B+               85
3       b0000          B-               46
4       b0000         AB+               93

In [20]:
inventory_details.to_sql("inventory", blood_bank_db_engine, method='multi', if_exists='append', index=False)

8000

In [21]:
pd.read_sql_query("SELECT * FROM inventory", blood_bank_db_engine)

     bloodbankid blood_group  units_available
0          b0000          A+               35
1          b0000          A-               65
2          b0000          B+               85
3          b0000          B-               46
4          b0000         AB+               93
...          ...         ...              ...
7995       b0999          B-               75
7996       b0999         AB+               22
7997       b0999         AB-               34
7998       b0999          O+                4
7999       b0999          O-               53

[8000 rows x 3 columns]

In [22]:
ngo_details[ngo_details["ngo_id"] == "ngo0127"]

      ngo_id         n_name                                   address
126  ngo0127  World Concern  6573 Beaverwood Drive Knoxville TN 37995

In [23]:
#(recipient_id, r_name, age, blood_group, location_received_ngo, location_received_hospital, contact_number)
recipient_details.head()
recipient_details. columns = ["r_name", "age", "blood_group", "location_received_ngo", "location_received_hospital", "contact_number", "recipient_id"]

In [24]:
recipient_details = recipient_details[["recipient_id", "r_name", "age", "blood_group", "location_received_ngo", "location_received_hospital", "contact_number"]]

In [25]:
recipient_details.to_sql("recipient", blood_bank_db_engine, method='multi', if_exists='append', index=False)

3000

In [26]:
pd.read_sql_query("SELECT * FROM recipient", blood_bank_db_engine)

,recipient_id,r_name,age,blood_group,location_received_ngo,location_received_hospital,contact_number
0,rc0000,Gilda Lancaster,26,B+,ngo0126,None,(505)386-5306
1,rc0001,Burt Garrison,30,A-,ngo0114,None,(850)654-8333
2,rc0002,Queen Teague,16,A+,None,hosp0035,(786)561-1206
3,rc0003,Dewey Villagomez,30,AB+,ngo0125,None,(925)419-4394
4,rc0004,Ellsworth Raymond,72,A-,ngo0073,None,(615)948-1222
...,...,...,...,...,...,...,...
2995,rc2995,Irvin Guerra,91,O+,ngo0080,None,(612)223-2817
2996,rc2996,Hilton Griffis,47,A-,ngo0055,None,(337)703-4207
2997,rc2997,Alma Brice,2,AB+,ngo0082,None,(802)433-8679
2998,rc2998,Tomasa Menendez,81,A-,ngo0014,None,(865)156-2500
2999,rc2999,Jovita Gant,43,O+,None,hosp0032,(440)333-4709

In [27]:
request_details = request_details[["ID", "PatientID", "DonorID", "Loc_Obtained", "BloodGroup", "Waitlist", "Completed"]]
request_details.columns = ["request_id","patient_id","donor_id","location_obtained","blood_group","waitlist","completed"]
request_details.to_sql("request", blood_bank_db_engine, method='multi', if_exists='append', index=False)
pd.read_sql_query("SELECT * FROM request;", blood_bank_db_engine)

,request_id,patient_id,donor_id,location_obtained,blood_group,waitlist,completed
0,rq0000,rc0637,None,b0038,A-,4,False
1,rq0001,rc1668,d2475,b0712,B-,0,True
2,rq0002,rc2501,d1650,b0441,B+,0,True
3,rq0003,rc1300,None,b0850,AB-,6,False
4,rq0004,rc2713,None,b0510,O-,4,False
...,...,...,...,...,...,...,...
2995,rq2995,rc1573,d0945,b0218,A+,0,True
2996,rq2996,rc1355,None,b0111,B+,4,False
2997,rq2997,rc2438,d2475,b0391,B-,0,True
2998,rq2998,rc0927,d2149,b0347,AB-,0,True
2999,rq2999,rc2822,d0560,b0666,O-,0,True

In [28]:
pd.read_sql_query("SELECT * FROM request WHERE waitlist <> 0;", blood_bank_db_engine)

,request_id,patient_id,donor_id,location_obtained,blood_group,waitlist,completed
0,rq0000,rc0637,None,b0038,A-,4,False
1,rq0003,rc1300,None,b0850,AB-,6,False
2,rq0004,rc2713,None,b0510,O-,4,False
3,rq0005,rc0483,None,b0759,AB-,5,False
4,rq0008,rc0451,None,b0640,A-,2,False
...,...,...,...,...,...,...,...
852,rq2978,rc2416,None,b0499,A-,2,False
853,rq2982,rc0723,None,b0425,O+,2,False
854,rq2985,rc0637,None,b0557,A-,9,False
855,rq2988,rc1340,None,b0107,A+,9,False
856,rq2996,rc1355,None,b0111,B+,4,False